## DF4IAH: UFBmod


create_clock -period 83.330 -name sys_clk_pin -waveform {0.000 41.660} -add [get_ports sysclk]

create_clock -period 10.000 -name VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0 -waveform {0.000 5.000}

set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.000 [get_ports {MemDB[*]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports {MemDB[*]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.000 [get_ports {btn[*]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports {btn[*]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.000 [get_ports {led[*]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports {led[*]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.000 [get_ports {qspi_dq[*]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports {qspi_dq[*]}]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.000 [get_ports ledrgb_b]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports ledrgb_b]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.000 [get_ports ledrgb_g]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports ledrgb_g]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.000 [get_ports ledrgb_r]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports ledrgb_r]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.000 [get_ports usb_uart_rxd]
set_input_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports usb_uart_rxd]

set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports {MemAdr[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports {MemAdr[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports {MemDB[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports {MemDB[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports {led[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports {led[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports {qspi_dq[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports {qspi_dq[*]}]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports RamCEn]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports RamCEn]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports RamOEn]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports RamOEn]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports RamWEn]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports RamWEn]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports ledrgb_b]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports ledrgb_b]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports ledrgb_g]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports ledrgb_g]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports ledrgb_r]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports ledrgb_r]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports qspi_cs]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports qspi_cs]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -min 0.500 [get_ports usb_uart_txd]
set_output_delay -clock [get_clocks VIRTUAL_clk_100mhz_AXI_bd_0_clk_wiz_0] -max 3.300 [get_ports usb_uart_txd]
